[
	{
		"idjob" : 52,
		"jobTitle" : "Software Engineer, C++ and CUDA - New College Graduate 2023",
		"companyName" : "NVIDIA",
		"companyLocation" : "Santa Clara, CA",
		"jobDescription" : "We're looking for outstanding engineers and scientists to apply their parallel programming skills to accelerate NVIDIA's open source software suite for data science, RAPIDS. RAPIDS combines the performance of modern GPUs with the ease of use of Python and Scala APIs. You will work on building the computational core for dataframe and database accelerators - a highly-optimized C++ and CUDA library that leverages the parallel nature of GPUs to accelerate fundamental data operations from load and parsing, to joins, aggregations, and more. Come bring your creativity and problem solving skills to our open source software suite, and you can be our next major contributor!\nWhat you’ll be doing:\nDeveloping novel, parallel algorithms to accelerate core problems in data processing and power the next generation of data center workflows\nImplementing solutions in C++ and CUDA\nContributing to open source RAPIDS projects, such as cuDF\nBenchmarking, profiling, and optimizing code\nWorking closely with the world’s top experts in GPU hardware, software and workflows\nWhat we need to see:\nCompleting a MS degree or PhD in computer science, engineering, or a related field (or equivalent experience)\nStrong Modern C++ programming skills\nFamiliarity with at least one parallel programming framework, such as CUDA, OpenACC, OpenMP, etc.\nYou care deeply about robust, readable, high-performance code\nExcited to learn, explore new problem areas, and apply your creativity to some of the most challenging and rewarding problems we have\nWays to stand out from the crowd:\nFamiliarity with RAPIDS\ncuDF\nExperience in data science workflow development and debugging\nPassion for publishing your work in technical blogs, conferences\nWith competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the technology industry's most desirable employers. We have some of the most forward-thinking and talented people in the world working with us and our engineering teams are growing fast in some of the most impactful fields of our generation: Deep Learning, Artificial Intelligence, and Autonomous Vehicles. If you're a creative engineer who enjoys autonomy and shares our passion for technology, we want to hear from you.\nThe base salary range is $100,000 - $184,000. Your base salary will be determined based on your location, experience, and the pay of employees in similar positions.\nYou will also be eligible for equity and\nbenefits\n.\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=72c3855e747f64a0&fccid=c267f29f0f85e8b8&vjs=3"
	},
	{
		"idjob" : 53,
		"jobTitle" : "Software Engineer, Apple Pay",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Jun 22, 2023\nWeekly Hours: 40\nRole Number: 200484261\nImagine what you could do here! At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Are you passionate about building massively scalable services that surprise and delight? Do you have a natural curiosity for learning new technologies? If you are passionate about software engineering, crave building systems that run at scale, love solving meaningful problems, thrive in a fast paced environment, then we would love to hear from you!\nKey Qualifications\nWe want you to have experience with object-oriented analysis and design with languages like Java\nWe are looking for experience in developing scalable and distributed systems\nExperience authoring and supporting web services\nExperience with Relational and NoSQL Databases\nExperience/understanding of security and cryptography (not mandatory)\nDescription\nApple Pay brought mobile payment to millions of customers, and it’s just the beginning. We are looking for engineers who are equally comfortable working at the bits and bytes level and designing state-of-the-art objected-oriented web services. The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. JOB DUTIES INCLUDE THE FOLLOWING: - Architect and implement new features for Apple Pay Write bullet-proof Java code (thread-safe, performant, object-oriented, and inherently testable) - Work directly with the business team to collaborate on current and future initiatives - Work directly with the iOS client team on feature definition and development - Design specifications and protocols to tackle novel problems Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants!\nEducation & Experience\nBS degree in computer science or equivalent field plus 3-4 years software development experience or MS degree plus 1-2 years software development experience, or equivalent\nAdditional Requirements\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $138,900 and $256,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=d823e3454322520d&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 54,
		"jobTitle" : "Cloud Software Engineer",
		"companyName" : "Hewlett Packard Enterprise",
		"companyLocation" : "6280 America Center Drive, San Jose, CA 95002",
		"jobDescription" : "Cloud Software Engineer\n\nThis role has been designated as ‘Edge’, which means you will primarily work outside of an HPE office.\nWho We Are:\nHewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.\nJob Description:\n\nHewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.\nAruba, a Hewlett Packard Enterprise Company, is a leading provider of next-generation working solutions for the mobile enterprise: htttp://www.arubanetworks.com/company/about-us .\nSounds like you? Then we have the right opportunity for you!\nHow You'll Make Your Mark:\nContribute to several applications and modules starting from data ingestion, distributed computing, near real time analytic engines.\nDevelop cloud based applications and SaaS platform with high throughput and reliability on Apache Spark and Kubernetes.\nAnalyze and validate telemetry data, learn error patterns and produce views that show network problem conditions and pattens\nRemove errors in data reported from devices for consumption by analytics engines downstream\nWork with a team of data scientists, domain experts, architects and other engineers to increase the accuracy of AI outcomes in our device management product\nEducation and Experience Required\nBachelor's or Master's degree in Computer Science, Information Systems, or equivalent\nKnowledge and Skills\nProgramming in at least one of Python, Java or Scala\nWorking Knowledge of Wireless and Wired Networking Protocols\nStrong analytical and problem solving skills\nExcellent written and verbal communication skills\nAbility to effectively communicate product architectures, design proposals\nJoin us and make your mark!\nWhat we can offer you:\nExtensive benefits, a competitive salary and participation in the shared values and purpose that make Hewlett Packard Enterprise one of the world´s most attractive employers! At HPE, our goal is to provide equal opportunities, flexible work-life balance, and constantly evolving career growth.\nIf you are looking for challenges in an exciting, supportive, and international work environment, then we definitely want to hear from you. Continue the conversation by clicking apply now below, or directly via our Careers Portal at www.hpe.com/careers.\nThen let’s stay connected!\nFind out more about us and follow us on:\nhttps://www.facebook.com/HPECareers\nhttps://twitter.com/HPE_Careers\nHPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together.\n#Aruba #ArubaUS #Diversity #UnitedStates\nAdditional Skills:\nCloud Architectures, Cross Domain Knowledge, Design Thinking, Development Fundamentals, DevOps, Distributed Computing, Microservices Fluency, Full Stack Development, Release Management, Security-First Mindset, User Experience (UX)\nWhat We Can Offer You:\nHealth & Wellbeing\nWe strive to provide our team members and their loved ones with a comprehensive suite of benefits that supports their physical, financial and emotional wellbeing.\nPersonal & Professional Development\nWe also invest in your career because the better you are, the better we all are. We have specific programs catered to helping you reach any career goals you have — whether you want to become a knowledge expert in your field or apply your skills to another division.\nDiversity, Inclusion & Belonging\nWe are unconditionally inclusive in the way we work and celebrate individual uniqueness. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good.\nLet's Stay Connected:\nFollow @HPECareers on Instagram to see the latest on people, culture and tech at HPE.\n#aruba\nJob:\nEngineering\nJob Level:\nIntermediate\n\nStates with Pay Range Requirement\nThe expected salary/wage range for a U.S.-based hire filling this position is provided below. Actual offer may vary from this range based upon geographic location, work experience, education/training, and/or skill level. If this is a sales role, then the listed salary range reflects combined base salary and target-level sales compensation pay. If this is a non-sales role, then the listed salary range reflects base salary only. Variable incentives may also be offered. Information about employee benefits offered can be found at https://myhperewards.com/main/new-hire-enrollment.html.\nAnnual Salary: $84,600.00 - $194,700.00\nHPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together. Please click here: Equal Employment Opportunity.\nHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.\n\nHPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories.",
		"salary" : "$84,600 - $194,700 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=4dc577412a12a5cb&fccid=216eb700022de6f6&vjs=3"
	},
	{
		"idjob" : 55,
		"jobTitle" : "Software Engineer: Product",
		"companyName" : "Oxide Computer Company",
		"companyLocation" : "Emeryville, CA",
		"jobDescription" : "Oxide is bringing a cloud-like experience to on-premises compute with our integrated rack-scale server. The product team focuses on all the ways customers interact with the system, including the web console, API, CLI, SDKs, and documentation. To learn about how we work, listen to our Oxide and Friends conversation on web tooling.\nAs a product engineer, you will:\nWork with engineers and designers to build a fast and accessible web interface to the Oxide platform.\nUnderstand customer use cases and help define the Oxide product.\nWrite frontend code in TypeScript and API code in Rust. Most of the code you write will be open source, be it in the web console, OpenAPI client generator (oxide.ts), or control plane API (Omicron).\nUse your web expertise to help with other Oxide sites like RFDs, API docs, oxide.computer, and internal tools.\nLearn about all layers of the stack exposed to users through the API: fault-tolerant distributed systems and databases that support virtual machines, virtual storage devices, and virtual networks.\nCode without fear, supported by continuous builds, tests, a constructive code-review process, and a supportive culture of identifying and fixing bugs.\nThese responsibilities are just a starting place! We’re a small company, we don’t have rigid roles, and we have a lot to do — we can help you grow wherever your interests take you.\nYou will thrive in this role if you:\nWrite solid TypeScript, HTML, and CSS.\nApproach development with rigor and a product mindset.\nHave experience building user-friendly REST APIs.\nKnow or are interested in learning Rust.\nBelieve in fully documenting your ideas.\nEnjoy reading the documentation produced by others.\nGet excited about a wide range of technical topics and dig really deep into them.\nDon’t mind coworkers getting really excited about decades-old computer front panels.\nIf you don’t meet 100% of these qualifications you should still seriously consider applying! We all come from different backgrounds with different skills.\nLife at Oxide\nWe are very explicit about our values, and they can be seen in daily life at Oxide, for example:\nOur rigor means we enjoy and take pride in the craft of engineering.\nOur urgency means that we are not above the judicious short-cut.\nOur versatility is reflected in our greatest strength: the breadth of our team.\nOur transparency can be seen in our consensus-driven RFD process.\nOur responsibility means that we both lead and follow: we have our own domains, but we also help others on their parts.\nOur curiosity shows in our insatiable desire to learn – and our empathy in our love of teaching others.\nOur humor is a big part of our daily lives: we are inveterate wise-crackers whose video meetings spill into simultaneous text chat.\nWorking at Oxide\nRemote first\nMost of our team are based outside of the Bay Area. We do ask that your workday overlaps with Pacific Time for at least four hours.\nFlexible working hours\nOur families and lives outside of our jobs are very important to us; our schedules are flexible to reflect and support that.\nPremium healthcare\nWe offer the best medical PPO, dental, and vision plans we can find and cover 100% of premiums for employees and dependents.\nCompensation\nEveryone at Oxide makes $191,227 USD, regardless of location.",
		"salary" : "$191,227 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=88cbecba3b46a7c3&fccid=78fc32d909bd4f0b&vjs=3"
	},
	{
		"idjob" : 57,
		"jobTitle" : "Software Developer",
		"companyName" : "Virtusa",
		"companyLocation" : "Fremont, CA",
		"jobDescription" : "Support and develop new features for Android partner facing web applications\nDevelop new UI in Angular/Typescript\nFullstack development to connect UI with backend\nBachelor degree in computer science or equivalent\nProficiency in frontend development with 2+ yr experience and proficiency in Javascript/Typescript\nCollaborative teamwork skills and ability to communicate technical ideas effectively\nKnowledge of Angular, Protobuf and Java coding skills preferred\nAndroid ecosystem or security background\nAbout Virtusa\nTeamwork, quality of life, professional and personal development: values that Virtusa is proud to embody. When you join us, you join a team of 36,000 people globally that cares about your growth — one that seeks to provide you with exciting projects, opportunities and work with state of the art technologies throughout your career with us.\nGreat minds, great potential: it all comes together at Virtusa. We value collaboration and the team environment of our company, and seek to provide great minds with a dynamic place to nurture new ideas and foster excellence.\nVirtusa was founded on principles of equal opportunity for all, and so does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit, and business need.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=6ed6a3b54a473052&fccid=146443e77d8c0778&vjs=3"
	},
	{
		"idjob" : 58,
		"jobTitle" : "Staff Software Dev QA Engineer",
		"companyName" : "Fortinet",
		"companyLocation" : "1090 Kifer Road, Sunnyvale, CA",
		"jobDescription" : "Job Responsibilities\nReview and understand product functionality and requirement to identify test scenarios across cloud service applications\nCreate and execute test cases to ensure products assigned are thoroughly tested.\nDevelop and maintain automation to run test cases.\nBuild and maintain CI/CD pipelines to run automated test cases for efficient delivery\nBuild and maintain on-prem kubernetes environment to scale and run automated jobs\nBuild tools to ensure deployments are faster and reliable\nWork closely with development and Product management\nWork closely with development and Product management teams to understand functionality and provide efficient feedback.\nUse tools to report test case results and track defects to improve quality\nStay updated on new testing methodologies and tools to always improve the QA process\nJob Requirements\nHands-on experience testing services in on-prem and public cloud platforms\nBuild automation for deployments and operations using ansible, Python & shell scripting\nExpert knowledge of Jenkins to build automated deployment pipelines for cloud services\nExpert knowledge in Docker and Kubernetes for building highly scalable QA environments.\nKnowledge of testing mobile applications\nInvestigate and provide solutions to defects identified in various services owned by the team\nBuild and deploy connectors to test integration with various Fortinet cloud services for metric collection\nGood knowledge of Linux environments is essential\nAbility to troubleshoot and fix networking issues.\nGood knowledge of virtualization technologies will be an added advantage\nAbility and experience of working in a highly fast paced environment under pressure.\nThe US base salary range for this full-time position is $120,000-$165,000. Fortinet offers employees a variety of benefits, including medical, dental, vision, life and disability insurance, 401(k), 11 paid holidays, vacation time, and sick time as well as a comprehensive leave program.\nWage ranges are based on various factors including the labor market, job type, and job level. Exact salary offers will be determined by factors such as the candidate's subject knowledge, skill level, qualifications, experience, and geographic location.\nAll roles are eligible to participate in the Fortinet equity program, Bonus eligibility is reviewed at time of hire and annually at the Company’s discretion.\n#LI-BHAVYA\n#GD",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=6347046923eb78ed&fccid=28d99c55a9ebe7b6&vjs=3"
	},
	{
		"idjob" : 59,
		"jobTitle" : "Front End Engineer | AUI, AmazonUI",
		"companyName" : "Amazon.com Services LLC",
		"companyLocation" : "San Francisco, CA",
		"jobDescription" : "2+ years of non-internship professional front end, web or mobile software development using JavaScript, HTML and CSS experience\n1+ years of computer science fundamentals (object-oriented design, data structures, algorithm design, problem solving and complexity analysis) experience\nExperience using JavaScript frameworks such as angular and react\nAt AmazonUI, we own the look and feel of the the Amazon shopping experience. Our visual building blocks (a.k.a UI components), styling/interactivity libraries and build and build/deploy tools power the Amazon.com front end development ecosystem. AmazonUI is responsible for ensuring that the Amazon.com end to end customer experience is modern, fresh, visually coherent while exceeding industry standards for accessibility. Thousands of amazon engineers use our libraries and tools on a daily basis to build innovative experiences for shoppers on Amazon app and website. As a team, we value testability, maintainability, code quality, and cogent design.\n\nAs a Front End Engineer on the AUI team, your work will directly impact the developer experience of thousands of Store Builders worldwide. You will work alongside a team of experts to deliver technologies that help accelerate CX innovation at Amazon. You and the team will set the standard for frontend development in Amazon.\n\nKey job responsibilities\n\nAbout the team\nAUI team enables experience builders to innovate safely, rapidly, and efficiently for the Amazon Store, and accelerates builders by reducing the time and effort it takes to build new experiences for shoppers. Our programs accelerate frontend development by reducing the time and effort it takes to build new experiences for shoppers. We eliminate undifferentiated work by offering out-of-the box capabilities (e.g., reusable components) that are well-tested through automation. Our offerings extend beyond software to front-end evangelism and education.\n\nWe are open to hiring candidates to work out of one of the following locations:\n\nSan Francisco, CA, USA | Seattle, WA, USA\n\n1+ years of agile software development methodology experience\nExperience with common front-end technologies such as HTML, CSS, JS, TypeScript, and Node\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $115,000/year in our lowest geographic market up to $223,600/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. Applicants should apply via our internal or external career site.",
		"salary" : "From $115,000 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=9afa22121690c304&fccid=fe2d21eef233e94a&vjs=3"
	},
	{
		"idjob" : 60,
		"jobTitle" : "Full Stack Software Engineering, AMTS/MTS",
		"companyName" : "Salesforce",
		"companyLocation" : "415 Mission Street, 3rd Floor, San Francisco, CA 94105",
		"jobDescription" : "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\nJob Category\nSoftware Engineering\nJob Details\nAbout Salesforce\nWe’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place.\nPlatform Cloud is looking for a strong Full Stack Engineer to join our team to help us build a brand-new end to end system that will enable the scaling and automation of business processes in the Cloud. Our system follows a micro-services architecture, primarily leveraging Java and Spring Boot on the NextGen Cloud Infrastructure (Hyperforce), integrating with Generative-AI, Machine Translation, and 3rd party APIs. Our service is brand new, so there is a lot of opportunity for growth, innovation, and leadership.\n\nResponsibilities:\nDesign, implement, test, and deliver highly scalable products\nMaster our development process, culture, and code base, then improve it\nOperate effectively in the continuous integration and deployment (hybrid engineering) model where engineers are encouraged to be able to craft and implement the vital work and ensure quality of the code base.\nCollaborate with others on improving development technologies, tools, and processes\nPresent your own designs to internal/external groups and review designs of others\nDevelop test strategies, design test automation, and write unit/functional tests to drive up code coverage and automation metrics.\nParticipate in the team’s on-call rotation to customer escalations and keep services operational and highly available\n\nRequired skills:\nA related technical degree required\nDeep knowledge of object oriented programming and experience with at least one object oriented programming language (Java, Javascript, C++, C#, Ruby, Python)\nProficiency in at least one application framework (Spring boot, NodeJS, etc.)\nUnderstanding of Database technologies such as SQL, PL/SQL and relational database schema design\nExperience in automated testing including unit and functional testing using Java, JUnit, JSUnit, Selenium\nExcellent interpersonal skills\n\nPreferred Skills:\nUnderstanding of web technologies, such as JavaScript, CSS, HTML5, XML, JavaScript, and/or JSON\nExperience building highly scalable web applications\nExperience with Agile software development and test-driven development\nAccommodations\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form .\nPosting Statement\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com .\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce .\nSalesforce welcomes all.\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\nFor California-based roles, the base salary hiring range for this position is $108,800 to $183,900.\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com.",
		"salary" : "$108,800 - $183,900 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=2ef617bcc68ba215&fccid=4027cfd917e1ee29&vjs=3"
	},
	{
		"idjob" : 61,
		"jobTitle" : "Software Security Engineer, Apple Pay",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Jun 22, 2023\nWeekly Hours: 40\nRole Number: 200483922\nApple is a place where extraordinary people gather to do their best work. We don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. We believe it's the diversity of these people and their ideas that inspire the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Embedded within Apple's Wallet and Payments Server Engineering organization, Apple Pay Server Security team's mission is to ensure security of the applications, systems, and infrastructure powering Apple's Wallet and Payments services. The team is looking for a motivated engineer who is passionate about application, infrastructure, and cloud security and likes to design and develop secure solutions to protect these. As an engineer on this team you will partner with cross functional engineering teams working on new products, features, and cloud infrastructure to secure Wallet & Payments applications as well as design a secure foundation for services at Apple. This role will focus on secure design and architecture, threat modeling, building security solutions, and some security testing of applications and cloud/on-prem infrastructure. You will be working with partner teams in security engineering, privacy, and Information Security to keep Apple’s Wallet and Payments services secure for our users. If you love digging into complex systems, finding security gaps, and designing solutions with security in mind, we want to talk to you!\nKey Qualifications\nExperience in designing and developing secure infrastructure and cloud services.\nExperience in application and cloud infrastructure security.\nExperience in conducting security architecture reviews or security testing of applications and cloud infrastructure components.\nExperience with threat modeling frameworks and techniques.\nAbility to dig deep and comprehend sophisticated application flows and systems to identify security issues, edge cases, and propose secure design enhancements.\nUnderstanding of common infrastructure components and cloud services including, secure network architecture, network service proxies, identity and access, virtualization and containerization, Kubernetes, HSMs and secure execution environments.\nConversant in at least one programming language such as Java, Go, Python or Ruby\nAbility to organize & communicate effectively, both written and verbal, with technical and non-technical people across functional teams\nAbility to build and maintain strong internal and external collaborative relationships\nExperience with contactless payments, payment terminals, and transaction processing is a plus.\nDescription\nAs an engineer on this team, you will work with engineering teams throughout their development cycles conducting security reviews, threat modeling, security design verification and proposing security requirements and improvements. You will design, build, automate, and advocate for system wide security enhancements by partnering with engineering, cloud infrastructure, and security teams across Apple. You should be strongly motivated to learn new technologies. Your ownership of vulnerability, risk, and compliance processes will have you working hand-in-hand with engineering, infrastructure, compliance, and privacy teams to ensure the security, compliance, and privacy of critical customer systems.\nEducation & Experience\nBachelors in Computer Science / Engineering or related, with emphasis in security related fields (or equivalent experience).\nAdditional Requirements\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.\nApple benefits programs vary by country and are subject to eligibility requirements.\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $170,700 and $300,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=f8256351ba9f2a1f&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 62,
		"jobTitle" : "Software Engineering SMTS",
		"companyName" : "Salesforce",
		"companyLocation" : "415 Mission Street, 3rd Floor, San Francisco, CA 94105",
		"jobDescription" : "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\nJob Category\nSoftware Engineering\nJob Details\nAbout Salesforce\nWe’re Salesforce, the Customer Company, inspiring the future of business with AI+ Data +CRM. Leading with our core values, we help companies across every industry blaze new trails and connect with customers in a whole new way. And, we empower you to be a Trailblazer, too — driving your performance and career growth, charting new paths, and improving the state of the world. If you believe in business as the greatest platform for change and in companies doing well and doing good – you’ve come to the right place.\nSalesforce Inc. seeks Software Engineering SMTS in San Francisco, CA:\nJob Duties: Research, design, and develop computer and network software or specialized utility programs. Update software or enhance existing software capabilities. Develop infrastructure, automation, and tooling for the engineering and data science teams. Guide the direction of platform infrastructure to help scale software. Contribute to projects working towards evaluating cloud providers and building automation, scaling real time recommendations data storage, improving the code deployment process, and solving problems relating to the management of growing cloud infrastructure. Help develop the cloud infrastructure while maintaining the security, stability, and speed without sacrificing the features and products. Telecommuting is an option. Some travel to Salesforce offices may be required.\nMinimum Requirements: Master’s degree (or its foreign degree equivalent) in Computer Science, Information Systems, Engineering (any field), or a related quantitative discipline, and one (1) year of experience in the field of software engineering or one (1) year of experience in the job offered.\nA related technical degree required (Computer Science, Information Systems, Engineering (any field)).\nSpecial Skill Requirements: (1) Autoscaling; (2) Linux; (3) Jenkins; (4) Python; (5) Kafka; (6) Scala; (7) Java; (8) Spark; and (9) Big Data. Any suitable combination of education, training and/or experience is acceptable. Education, experience and criminal background checks will be conducted. Telecommuting is an option. Some travel to Salesforce offices may be required.\nSalary: $146,600.00 - $220,000.00 per annum.\nSubmit a resume using the apply button on this posting or by email at: onlinejobpostings@salesforce.com at Job #18-6610. Salesforce is an Equal Opportunity & Affirmative Action Employer. Education, experience, and criminal background checks will be conducted.\n#LI-DNI\nAccommodations\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form .\nPosting Statement\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at www.equality.com and explore our company benefits at www.salesforcebenefits.com .\nSalesforce is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce does not accept unsolicited headhunter and agency resumes. Salesforce will not pay any third-party agency or company that does not have a signed agreement with Salesforce .\nSalesforce welcomes all.\nPursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.\nFor California-based roles, the base salary hiring range for this position is $146,600 to $220,000.\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com.",
		"salary" : "$146,600 - $220,000 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=df0c63d894cefa03&fccid=4027cfd917e1ee29&vjs=3"
	},
	{
		"idjob" : 63,
		"jobTitle" : "iOS Software Engineer, Shortcuts",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Apr 14, 2022\nWeekly Hours: 40\nRole Number: 200367096\nPlay a part in the next revolution in human-computer interaction. Contribute to a product that is redefining computing. Create groundbreaking technology to provide intelligence around the apps you use every day. Work with the people who created Shortcuts, Siri, and iOS's Proactive intelligence that helps millions of people get things done. Join the Shortcuts team at Apple. The Shortcuts team is looking for iOS and macOS engineers passionate about building a phenomenal user experience that makes customers' lives easier. In this role, you'll be part of a small, talented, and motivated team that operates like a startup within Apple. You'll ship code that runs on the devices you use every day and powers products that are critical to the lives of millions of users!\nKey Qualifications\nExperience building applications in Objective-C or Swift\nKnowledge of Apple’s development APIs\nExperience creating complex and performant user interfaces with UIKit, AppKit, or SwiftUI\nFamiliarity with essential tools (Xcode, lldb, Instruments)\nOutstanding communication and presentation skills\nStrong API design knowledge\nDescription\nYou will primarily be responsible for implementing new features within a small team that moves quickly. To succeed in this role, you must be a strong programmer and a creative problem solver who thrives in a fast-paced environment, working across teams and organizations. You love building an elegant user experience and are passionate about improving productivity on mobile devices. You enjoy learning new things and creating life-changing applications. You are excited about developing new features, as well as maintaining existing code, fixing bugs, and contributing to overall system design. You care deeply about software architecture and writing code that is robust and maintainable for the future. You take the extra step to run your projects through Instruments and fine-tune performance to deliver the best experience to users. You know it’s all in the details.\nEducation & Experience\nB.S or M.S in Computer Science or a related field, or equivalent practical experience.\nAdditional Requirements\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $138,900 and $208,300, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=a1b6fc6ce18c2801&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 64,
		"jobTitle" : "Software Engineer, SLAM",
		"companyName" : "UNISON",
		"companyLocation" : "2212 Judah Street, San Francisco, CA",
		"jobDescription" : "About UNISON,\nUNISON is a small team of passionate people from companies like Meta, Sony, Apple and research labs like the IARAI, based in the SF Bay Area and backed by some of the world’s best investors.\nLearn more about us, our product, and team here: in-unison.com.\nAbout The Role\nWe are in search of a dedicated Software Engineer with a specialty in Visual-Inertial SLAM (VI-SLAM) to take ownership, design, develop, and maintain the VI-SLAM of our cutting-edge headset. This role is pivotal in enhancing our current VI-SLAM and metrics, defining and implementing robust test scenarios, and refining our simulation tool. Additionally, you will be entrusted with the creation of benchmarks to monitor the system's performance and its hardware specifications.\nYour Responsibilities\nDevelop a VI-SLAM system utilizing multiple cameras and IMUs within a constrained power budget.\nDesign and execute stress test scenarios to monitor system performance under challenging conditions.\nProfile the system, assessing the accuracy and uncertainties of all sensors and models, and identify potential model pitfalls.\nUpgrade our SLAM simulation tool to encompass all stress test parameters.\nAddress hardware-related questions that might influence software aspects, such as camera specifications and positioning.\nCollaborate closely with the hardware team, verifying and suggesting changes to hardware requirements, specifically for SLAM.\nCollaborate with the team building dedicated SLAM tools for our perception stack and data servers.\nYour Qualifications\nProven experience in real-time/production scale VI-SLAM workflows.\nA track record in hardware-oriented projects spanning UAV/Drones/AR/VR/Autonomous Vehicles realms.\nFamiliarity in the simulation of sensors involved on a VI-SLAM system.\nExperience with deep learning-based 3D vision algorithms applied to real-world challenges like VI-SLAM, 3D perception, obstacle avoidance or 3D Reconstruction.\nExperience in data fusion techniques involving IMU, cameras, IR, ToF, and other sensors.\nProficiency in C++, embedded systems and Computer Vision.\nDemonstrated capability to own projects from conception to completion, showing initiative, creativity, and a problem-solving approach.\nWhy UNISON?\nWe are a small team of passionate people working hard to create products that we would be proud to recommend to our friends and family. You can read more about careers at UNISON here: in-unison.com/careers.\nWe see living between virtual and physical worlds as a tool for creating, storytelling and sharing — not a hindrance to your total lived experience. You can learn more about our worldviews at in-unison.com.\nWe are growing quickly so if you’re interested in joining us but don’t see a job that fits what you’re looking for or if your experience doesn’t quite check all the boxes, please feel free to reach out – we are happy to connect.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=fbeda889bd459ba3&fccid=01e32e73264a1c69&vjs=3"
	},
	{
		"idjob" : 65,
		"jobTitle" : "RF Software Engineer",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Dec 20, 2022\nWeekly Hours: 40\nRole Number: 200449687\nDo you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. Do you want to have an impact on every single Apple product? As a RF Software Engineer on the Cellular Firmware team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing innovative cellular SoCs! This position requires someone comfortable with all aspects of embedded software development, that thrives in a multi-layered and multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements.\nKey Qualifications\nKnowledge of wireless communications and digital signal processing.\nKnowledge of RF transmit and receive process in HW and SW, and front-end component's control.\nKnowledge of RTOS and real-time embedded system.\nGood understanding of software engineering principles, and core computer science fundamentals is a plus.\nMinimum of 1+ years of C/C++ programming and debugging experience.\nDescription\n- Design and Implement RF device drivers and RF software to control RF transceivers and RF front end components with detailed timing requirements. - Design, develop and optimize the cellular modem processing algorithms pertaining to Baseband and RF components in a cellular system. - Work with Baseband & RF systems and hardware designers to define hardware architecture and software computing requirements. - Work with multi-functional teams to lead dependencies while driving the key Radio features.\nEducation & Experience\nMinimum BS\nAdditional Requirements\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $55.81 and $84.08/hr, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=d7515718a198807c&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 66,
		"jobTitle" : "Enterprise Developer",
		"companyName" : "California State University",
		"companyLocation" : "100 Campus Center, Seaside, CA 93955",
		"jobDescription" : "Campus:\nMonterey Bay\n\nJob ID: 529669\n\nJob Title:\nEnterprise Developer\n\nAppointment Type:\nProbationary\n\nTime Base:\nFull-Time\n\nDate Posted:\nJuly 5, 2023\nClosing Date:\nOpen until filled\n\nDescription:\nClassification: Analyst/Programmer - Career\nHours: Full-time / 40 hours per week\nFLSA: Exempt\nAnticipated Hiring Salary Range: $7,000 per month\nCSU Salary Schedule\nCSUMB provides pay scales representing its good faith estimate of what the university reasonably expects to pay for this position. The pay offered to a selected candidate will be determined on factors such as (but not limited to) the scope and responsibilities of the position, the qualifications of the selected candidate, departmental budget availability, internal equity, and CSU systemwide pay for comparable jobs.\nPriority Screening Date: August 3, 2023\nRecruitment Status: Open Until Filled\n\nABOUT CSUMB\nPowered by an inspiring Founding Vision Statement, California State University, Monterey Bay (CSUMB) is a mid-sized comprehensive baccalaureate and masters granting university whose staff and faculty help transform student lives with a focus on student success and engagement through experiential learning, service learning in its regional community, and the promotion of multicultural and global perspectives on and beyond campus. With a vibrant, diverse student body of over 7,400 students. CSUMB is both a Minority Serving Institution (MSI) and a Hispanic Serving Institution (HSI).\nThe university’s Strategic Plan prioritizes inclusive excellence through recruiting and investing in the development of a diverse body of faculty, staff, and administrators. CSUMB’s sustainability initiative is to be carbon neutral by 2030. The university’s faculty and staff, many of whom live in the East Campus housing development, appreciate living and working so close to the shores of the beautiful Monterey Bay. As one of the 23 campuses in the California State University (CSU) system, CSUMB offers excellent benefits, including access to below-market-rate campus housing and competitive salaries for faculty and staff.\nPURPOSE:\nUnder the general supervision of the Associate Director of Enterprise Applications, the incumbent is responsible for the Design and Development, Documentation (Technical Specifications), Q/A Plan and Testing, Unit Testing for Information Technology (IT). This includes working independently on assigned tasks in close collaboration with other members of the IT team to address the specific needs of the University.\nESSENTIAL DUTIES AND RESPONSIBILITIES include, but are not limited to, the following:\nFunction in a team to implement new features in existing systems, and build new applications and services by designing and developing customer-based solutions and products utilizing enterprise development tools.\nWork with IT Team and various departments capturing and documenting department requirements for large and small projects, in order to design appropriate solutions. Provides recommendations for process and application improvements utilizing best practices for organization staff and data management. Communicates effectively via meetings and presentations.\nPerform unit and integration testing and assist with end user testing.\nWorks as system administrator consulting with various technical teams and vendors to troubleshoot issues with existing applications and development.\nCollaborates with IT and cross-functional/technical teams in requirements gathering, planning, coordination and implementation of new campus systems and projects.\nOther Functions:\nMay direct the tasks of student assistant(s).\nPerform other job-related duties and special projects as assigned.\nKNOWLEDGE, SKILLS AND ABILITIES:\nKnowledge of: Enterprise systems, applications, and technical standards; Linux/UNIX operating systems, database productivity tools including Oracle Enterprise Manager, SQL, SQL*Plus, PL/SQL, and SQL*Loader; data administration principles and data modeling concepts; technical and vendor documentation and ability to maintain internal documentation; system development life cycle and structured systems development concepts; system capability, design restrictions, and security requirements; client/server technologies, network connectivity, integration, configuration, and protocols.\nAbility to: Apply consultative skills to assess user needs and communicate technology systems and solutions; maintain databases and middleware applications through performance tuning and applying patches/fixes/upgrades; develop program implementation plans, install software, and apply fixes; identify hardware/software interface problems; perform interactive debugging and to test and analyze program failures; use systems workflow and logic flowchart techniques; use project management tools.\nMINIMUM QUALIFICATIONS:\nA basic foundation of knowledge and skills in database management, applications packages and programming, systems analysis and related programming support functions is a prerequisite. This foundation would normally be obtained through a bachelor's degree, preferably in computer science or business, or equivalent training and applied experience. Working knowledge of industry standard applications programming languages and knowledge of standard systems analysis techniques.\nSPECIALIZED SKILLS:\nExperience with Oracle/PeopleSoft tools, technology and architecture. Application Designer, PeopleCode, SQR, SQL and Data Mover.\nExperience with deploying/customizing 3rd party add-ons and managed packages\nExperience with custom integrations using APIs\nProject management skills and experience driving programs independently\nExperience with custom integrations using APIs\nExperience with database design, SQL\nPREFERRED QUALIFICATIONS:\nBachelor’s degree in Computer Science or equivalent, in addition to the required experience.\nAbility to write simple documentation on requirements discovery and solution design\nFamiliarity with industry-standard: Software and Systems Development Life Cycles (SDLC) and project management frameworks such as agile/scrum and waterfall.\nFamiliarity with industry-standard: IT Service Management (ITSM) for service areas such as incident, problem, change, communication, configuration, and release management.\nExperience with JavaScript, HTML, CSS, JavaScript ES6, JSON, REST, XML, Bash.\nExperience with NodeJS and NPM.\nKnowledge of managing packages and dependencies for web applications.\nExperience using GitHub Version Control systems.\nSPECIAL CONDITIONS OF EMPLOYMENT & POSITION DESIGNATIONS:\nAll offers of employment are contingent upon the successful completion of a background check (including a criminal records check).\nThe person holding this position is considered a “mandated reporter” under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.\nThis position will have a duty to report to the Campus Title IX Officer information pertaining to victims of sex discrimination, sexual harassment, sexual misconduct, dating/domestic violence, and stalking as required by CSU Executive Order 1095.\nThis position has been designated as a sensitive position with access to and responsibility for detailed personally identifiable Level 1 confidential information about students, faculty, staff or alumni that is protected, personal or sensitive as defined in the CSU Information Security Data Classification Standards.\nThis position is required to comply with confidentiality requirements outlined in the Department of Education’s Family Educational Rights and Privacy and California’s Educational Code Chapter 13 regarding sensitive student issues.\nMust possess and maintain a valid license to drive in the State of California, pass the Defensive Training Class, and be insurable under the University's liability coverage.\nMay require occasional evenings and/or weekend work.\nThis position has been designated as a sensitive position with:\naccess to and responsibility for detailed personally identifiable Level 1 confidential information about students, faculty, staff or alumni that is protected, personal or sensitive as defined in the CSU Information Security Data Classification Standards\ncontrol over campus business processes, either through functional roles or system security access.\nPHYSICAL ENVIRONMENT:\nPosition requires some travel, mobile work locations, and working at a computer and desk for extended periods of time. This is an exempt position that may require extended or varied hours, including some weekends, and may require travel between campus offices and off-campus locations.\nSome lifting up to 20 pounds\nThe health and safety of our students, faculty, and staff remain our highest priority. While on campus, students, faculty, staff, and the community will be expected to follow\nBENEFITS/PERKS:\nCSUMB offers a premium benefit package that includes outstanding vacation, health, dental and vision plans; membership in the California Public Employees Retirement System (CalPERS); and 15 paid holidays a year. For more information, visit Employee Benefits Summary. As a perk, the University Corporation at CSU Monterey Bay provides access to affordable campus housing based on availability; visit Schoonover Employee Housing for more information.\nAPPLICATION PROCEDURE:\nFor full consideration, applicants must complete the required online application prior to the priority screen date found at Careers at CSUMB. Application submissions received after the application screening date will be reviewed at the discretion of the University. Materials submitted become the property of CSUMB and will not be returned.\nCSUMB is not a sponsoring agency for staff or management positions.\nReasonable accommodations will be provided for qualified applicants with disabilities who self-disclose by contacting Human Resources at (831) 582-3389 or emailinghumanresources@csumb.edu. All employees must be eligible for employment in the U.S.\nGENERAL INFORMATION:\nCSUMB hires only individuals lawfully authorized to work in the United States and is an E-Verify employer. In compliance with federal crime awareness and campus security legislation, including the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics, you can view the notice of availability and access the Cal State University, Monterey Bay annual security and fire safety reports at\nCSUMB is a smoke and tobacco-free campus.\nAFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER:\nCSUMB is an Equal Opportunity-Affirmative Action employer seeking to recruit and support a broadly diverse community of faculty and staff. We value and celebrate diversity in all its forms and strive to foster an inclusive culture built on respect that affirms inter-group relations and builds cohesion. We consider qualified applicants for employment for their anticipated contributions and without regard to race, color, religion, national origin, age, gender, gender identity or expression, sexual orientation, genetic information, medical condition, pregnancy, marital status, veteran status, or disability.",
		"salary" : "$7,000 a month",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=d6baaa7e6f295dd4&fccid=938c68fc89db4b9d&vjs=3"
	},
	{
		"idjob" : 67,
		"jobTitle" : "Machine Learning Infrastructure Software Engineer, Project Tidal (6 months contract)",
		"companyName" : "Loon",
		"companyLocation" : "Mountain View, CA",
		"jobDescription" : "X is Alphabet’s moonshot factory. We are a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people. Our goal: 10x impact on the world’s most intractable problems, not just 10% improvement. We approach projects that have the aspiration and riskiness of research with the speed and ambition of a startup.\nAbout the team:\nTidal is a team at X working on a moonshot to protect the ocean and preserve its ability to support life and help feed humanity, sustainably. Our initial area of focus is on developing hardware and software technologies that bring greater visibility and understanding of what’s happening under the water. Learn more about Project Tidal.\nAbout the role:\nAs an Applied Machine Learning Software Engineer at Tidal, you will be working alongside other software engineers, perception experts, and research scientists to develop and deploy state-of-the-art methods to create a platform leveraging perception and machine learning to solve humanity’s biggest problems — from food production to renewable energy to climate change — by sustainably utilizing the ocean.\nYour role will be to enable developers to run ML workflows smoothly and efficiently. You will develop sustainable, scalable solutions to ensure the reliability and performance of these ML workflows, improve engineer productivity and ultimately help advance our Perception and ML Platform. If you love getting tech to work on challenging, real world problems, please apply!\nHow you will make 10X Impact\nWork with our customers to understand the problem space, run experiments, collect data, and design novel and breakthrough ML solutions\nProfile ML performance at both model level and system level, identify performance bottlenecks and optimization opportunities\nImprove and streamline large-scale machine learning workflows for training and inference by analyzing, understanding, and fixing bottlenecks\nEnable better component-wise testing of training workflows\nAutomate data upload/processing/training/evaluating/deploying/optimizing pipelines and develop monitoring and notification tooling to track statistics of the pipelines, improving debuggability and introspection into these complex workflows\nRespond to and resolve emergent problems in production; test ML training pipelines; write software and build automation to prevent problem recurrence\nKeep track of major changes and trends in infrastructure and enable adoption of new frameworks and systems without significant impact on development work\nEngage in capacity planning, quota management, and demand forecasting for ML workflows\nCollaborate with stakeholder teams to implement and evolve large-scale Machine Learning infrastructure\nWhat you should have:\nBS degree in Computer Science or a related field, or equivalent practical experience\nStrong programming skills in Python and/or C++\nExpertise in data structures, algorithms and complexity analysis.\nExperience designing, analyzing, and troubleshooting large-scale distributed systems, especially enterprise cloud services (e.g., GCP, AWS)\nExperience with ML platforms, solutions, and infrastructure deployed to solve real world problems\nIt’d be great if you also had these:\nExperience with C++ and/or Go\nExperience with TensorFlow or Pytorch\nExperience with SQL or similar, and parallel data processing pipelines (e.g. Flume, Apache Beam)\nExpertise in architecting and deploying machine learning pipelines at scale\nExpertise in getting ML models into production\nFamiliarity with state-of-the-art ML models for perception/computer vision tasks\nCustomer-facing experience creating software solutions\nMS or PhD degree in Computer Science or a related field, or equivalent practical experience\nThe US base salary range for this full-time position is a prorated amount from $133,000 - $202,000 + bonuses + benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits.\nAt X, we don't just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. We are proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\nIf you have a disability or special need that requires accommodation, please contact us at: x-accommodation-request@x.team.",
		"salary" : "Full-time, Contract",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=9ff544202388fe15&fccid=d2776a31bd03907b&vjs=3"
	},
	{
		"idjob" : 68,
		"jobTitle" : "Embedded QA Automation Engineer",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Aug 22, 2023\nWeekly Hours: 40\nRole Number: 200496320\nAre you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Core Virtualization team is looking for an Embedded QA Automation Engineer to join an innovative team responsible for ensuring the quality of key firmware and software technologies for the Macintosh product line. Core Virtualization team is responsible for bringing up macOS and Linux (in virtualized environment) on all new Macintosh products, including the development and integration of firmware and systems software for macOS and Linux, the development of platform-level features for the Macintosh, and the leadership of cross-functional debug and optimization efforts across hardware and software teams.\nKey Qualifications\nExperience with automation development and hands on “systems” testing\nDriver testing and qualification experience\nExperience working on test automation development and Linux system testing\nProgramming skills preferably using Python, shell scripting, objective-C/C or C++\nExperience coding Unit Tests/Integration Tests/System Tests/Regression Tests and test execution in an automation framework\nUnderstanding of system architecture and experience qualifying device drivers\nKernel level debugging is a big plus\nExcellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, and other organizations within Apple\nCreative thinker and strong problem solver with meticulous attention to detail\nStrong test planning ability is a big plus.\nDescription\nThe Linux QA Automation Engineer is responsible for testing and ensuring the quality of the customer experience when running Linux under virtualization. Primary job responsibilities include: Work closely with developers to understand virtualization technologies in macOS and use-cases to run Linux in that environment Validation of Linux device drivers and system functionality in a virtualized environment Debug and root-cause variety of hardware and software issues Creating test plans with development engineers for specific features and Mac hardware programs Developing automated test frameworks and automation harnesses to enable comprehensive component-level test coverage Coordinating with cross-functional test engineering and QA teams to ensure adequate test coverage of complex features Identifying and vocalizing risks areas during product and technology development Being an advocate for the user, representing the needs of our end user community\nEducation & Experience\nBachelors/Masters degree in {CS, CE, EE} or a degree plus significant programming experience or equivalent industry experience required\nAdditional Requirements\nKnowledge of Virtualization technologies such as VirtIO, KVM. Experience with macOS, iOS and Xcode\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $116,100 and $208,300 annualized, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=d052e1947932b0ce&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 69,
		"jobTitle" : "Principal Machine Learning Engineer (AI, NLP, LLM, Generative AI)",
		"companyName" : "Palo Alto Networks",
		"companyLocation" : "Santa Clara, CA",
		"jobDescription" : "Company Description\n\nOur Mission\nAt Palo Alto Networks® everything starts and ends with our mission:\nBeing the cybersecurity partner of choice, protecting our digital way of life.\nOur vision is a world where each day is safer and more secure than the one before. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.\nFLEXWORK is an employee-centric reimagining of how we work. We built FLEXWORK based on employee feedback – it is about flexibility, trust, and choice whenever possible. It’s been a journey of disruption that has yielded the best of our values. We offer as much flexibility as possible, and choices that enable you to be most productive, including benefits that meet your needs and learning opportunities that you feel passionate about.\nOur Approach to Work\nAt Palo Alto Networks, we believe in the power of collaboration and value in-person interactions. This is why our employees generally work from the office three days per week, leaving two days for choice and flexibility to work where you feel most effective. This setup fosters casual conversations, problem-solving, and trusted relationships. While details may evolve, our goal is to create an environment where innovation thrives, with office-based teams coming together three days a week to collaborate and thrive, together!\n\nJob Description\n\nYour Career\nYou will have the opportunity to build a career solving network security challenges leveraging advanced machine learning techniques on exabytes of data. You will help create and deliver the most advanced AI and Machine Learning enabled solutions to discover threats, provide intelligence and protect devices.\nYour Impact\nYou will work in a fast paced team to create and deliver new product and mission features to the security platform that many customers use on a daily basis\nYou will actively engage and contribute to the security community through collaborations\nYou will be part of the team that is leading and driving industry technology evolution in security and creating a positive impact on business\nDesign and development of workflow frameworks (using formal methods and algorithms), with result collection and visualization, monitoring tools\nCreation and delivery of training materials\n\nQualifications\n\nYour Experience\nM.S. or Ph.D degree in Computer Science, Mathematics, Electrical Engineering or related field or equivalent military experience required\n8+ years industry experience in Machine Learning techniques and data analytics\n8+ experience in design, algorithms and data structures - Expertise with one or more of the following languages is must - Java, C++, Python, Rust\nExperience with NLP, Recommender Systems, and LLM is strongly preferred\nExperience with Formal Methods toolchain (z3, cvc5, TLA+) will be a plus\nExcellent communication skills with the ability to influence at all levels of the organization\nA self driven individual contributor and an excellent team player\n\nAdditional Information\n\nThe Team\nDrawing on the near real-time data collected through PAN-OS device telemetry, our industry-leading next generation insights product (AIOps for NGFW) gives large cybersecurity operators a force multiplier that provides visibility into the health of their next-generation-firewall (NGFW) devices. It enables early detection of issues at various levels of the stack via advanced time-series forecasting and anomaly detection using novel deep learning techniques. Our goal is to be able to prevent service-impacting issues in critical security infrastructure that operates 24/7/365 with zero false positives and zero false negatives.You will be working on the best large language model in the cyber security industry.\nOur Commitment\nWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.\nWe are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.\nPalo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.\nAll your information will be kept confidential according to EEO guidelines.\nThe compensation offered for this position will depend on qualifications, experience, and work location. For candidates who receive an offer at the posted level, the starting base salary (for non-sales roles) or base salary + commission target (for sales/commissioned roles) is expected to be between $140,100/yr to $226,600/yr. The offered compensation may also include restricted stock units and a bonus. A description of our employee benefits may be found here.",
		"salary" : "$140,100 - $226,600 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=6626f909e8054e4b&fccid=0562f887e2bed9ea&vjs=3"
	},
	{
		"idjob" : 70,
		"jobTitle" : "Wireless Software and Systems Engineer",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Jan 18, 2023\nWeekly Hours: 40\nRole Number: 200455625\nAre you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Join the Wireless Technologies and Ecosystems organization and be part of an extraordinary team of engineers. We work with cross functional teams to drive innovation and develop products used by millions worldwide. Apple’s Wireless Software Architecture team is seeking dedicated, highly motivated and self-directed engineers to work across layers on innovative cellular technologies. The position involves identifying and developing core wireless technologies that solve everyday problems for customers using iPhone, iPad, Watch and other wireless product lines.\nKey Qualifications\nHands on experience in Software development/system engineering\nDevelopment experiences with real-time operating systems\nExperience in writing software for multi-threaded environments\nStrong Software Engineering skills including Design, Programming in C, C++ or Objective C and Debugging\nWorking experience with Open source Software is a plus\nExperience in developing frameworks and APIs is a plus\nKnowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus.\nHome automation experience is a plus (Bluetooth, ZigBee, z-Wave, Thread Mesh)\nConsistent record of project deliverables from concept to commercialization\nPassionate and inquisitive with a focus on solving everyday problems in innovative ways\nAttention to the smallest details that are meaningful to customers\nDescription\nApple’s Cellular Software team is seeking passionate, highly motivated and focused engineers to work across layers on groundbreaking cellular technologies. The position involves identifying and/or developing core cellular technologies that solves everyday problems for customers using iPhone, iPad, Watch and other wireless product lines. This team takes pride in not just coming up with proven software designs but also in disrupting traditional models of the cellular ecosystem. We go above and beyond to bring user experience to the next level. Working as a part of an extraordinary development team, we are searching for a highly motivated software developer. In this position, you will have the opportunity to develop exciting features for Apple’s next generation products. You work will involve wireless software and protocol development. Your contributions will make a clear difference towards future Apple products.\nEducation & Experience\nBachelor's degree in Electrical Engineering, Wireless Communications or equivalent\nAdditional Requirements\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $138,900 and $256,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=8c79f466caa75026&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 71,
		"jobTitle" : "Staff Software Engineer, Merchandising",
		"companyName" : "ThredUp Inc.",
		"companyLocation" : "969 Broadway, Oakland, CA 94607",
		"jobDescription" : "About thredUP\nthredUP is transforming resale with technology and a mission to inspire a new generation of consumers to think secondhand first. By making it easy to buy and sell secondhand, thredUP has become one of the world’s largest resale platforms for women’s and kids’ apparel, shoes and accessories. Sellers love thredUP because we make it easy to clean out their closets and unlock value for themselves or for the charity of their choice while doing good for the planet. Buyers love shopping value, premium and luxury brands all in one place, at up to 90% off estimated retail price. Our proprietary operating platform is the foundation for our managed marketplace and consists of distributed processing infrastructure, proprietary software and systems and data science expertise. In 2018, we extended our platform with thredUP’s Resale-As-A-Service (RaaSⓇ), which facilitates modern resale for a number of the world’s leading brands and retailers. thredUP has processed over 125 million unique secondhand items from 35,000 brands across 100 categories. By extending the life cycle of clothing, thredUP is changing the way consumers shop and ushering in a more sustainable future for the fashion industry.\nJob Description\nHow You Will Make An Impact\nthredUP has close to 100 engineers in product engineering, operations engineering, data science & analytics, data engineering, and cloud engineering teams. We’re looking for a seasoned Staff engineer to join our small but mighty Merchandising Engineering team — a team of polyglot software engineers focused on innovating how our users find products they love. From search, filters, personalization & recommendation, and base product catalog taxonomy, you will support leading the team with a cohesive technical strategy. You will extend your influence by leading, educating, mentoring, and coordinating engineering projects to improve our technology, engineering processes, and effectiveness of our engineers.\nIn This Role You'll Get To:\nArchitect, build, maintain, and improve the systems that power our product catalog, search, and personalization\nCollaborate with your peers and other cross-functional teams across time zones to ensure our platforms can scale the business and yield desired results\nSet realistic timelines with effective communication to technical/business stakeholders\nContribute towards improving our processes and engineering culture\nServe as an engineering leader for both the Merchandising team, and Engineering Org — levelingUP the skills & expertise of others on the team\nWhat We’re Looking For:\n8+ years of production level software engineering experience for large scale applications\nStrong back-end engineering experience in JVM-ecosystem\nExceptional track record in delivering quality engineering solutions at different levels of the stack\nStrong experience in distributed systems design and best practices\nStrong experience with continuous integration, test automation, and monitoring\nExperience with Kubernetes, AWS, event based system, and cloud-based services\nAdeptness in tactful feedback via code reviews, refinements, and everyday collaboration\nAbility to work in a cross-functional team and strong product comprehension.\n(Bonus) Ruby on Rails experience\n(Bonus) Elasticsearch/OpenSearch experience\n(Bonus) ML experience\n(Bonus) E-commerce experience\n\nAt thredUP, your base pay is one part of your total compensation package. This role pays between $170,000 and $284,000, and your actual base pay will depend on your skills, qualifications, experience, and location.\n\nMany thredUP employees also have the opportunity to own shares of thredUP stock. thredUP employees are eligible for discretionary restricted stock unit awards, as well as a discount when purchasing thredUP stock if voluntarily participating in thredUP’s Employee Stock Purchase Plan. Subject to eligibility requirements, you’ll also receive other benefits: Comprehensive medical & dental coverage, vision, 401k, life and disability insurance.\nWhat We Offer:\n4-day work week, with Fridays off\nHybrid work environment: 3 days in the office and 1 day remote each week\nCompetitive salary (we leverage market data)\nMany thredUP employees also have the opportunity to own shares of thredUP stock and are eligible for discretionary restricted stock unit awards\nEmployee stock purchase plan\nFlexible PTO (take the time you need) + 13 company holidays\nPaid Sabbatical after 3 years of full time employment\nGenerous paid parental leave for new mothers and fathers\nMedical, dental, vision, 401k, life and disability insurance offered\nWe live by our Core Values of Transparency, SpeakingUP, Thinking Big, Infinite Learning, Influencing Outcomes & Seeking the Truth\nRaaS - Inc. Magazine, 2022 Power Partner Awards\nThrift the Look– TIME Magazine, The Best Inventions of 2022\nWinner of Lattice's “People Vision” - recognizing thredUP as a top place to work for our investment in professional development and our innovations in work-life integration\nWe believe diversity, inclusion and belonging is key for our team\nAt thredUP, our mission has been built on extending the lives of millions of unique clothing items. Much like our inventory, we are proud to have fostered a workplace that is one-of-a-kind. As a company focused on diversity, inclusion and belonging, we are committed to ensuring our employees are comfortable bringing their authentic selves to work every day. A unique perspective is critical to solving complex problems and inspiring a new generation to think secondhand first. Be you.\nIf you are a candidate with a disability and have a reasonable accommodation request for the job application process, please email disabilitysupport@thredup.com the specific details of your disability related accommodation request. This email address is reserved for candidates with disabilities only. General application inquiries will not receive a response.",
		"salary" : "$170,000 - $284,000 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=c29ff57a7e8134a9&fccid=f287b6189e174df5&vjs=3"
	},
	{
		"idjob" : 72,
		"jobTitle" : "Frontend Engineer | VMware AI Labs - Opportunity for Working Remotely San Francisco, CA",
		"companyName" : "VMware",
		"companyLocation" : "San Francisco, CA",
		"jobDescription" : "Job Description:\nVMware AI Labs focuses on building differentiated technologies in AI, Generative AI, and adjacent systems. Advanced development (xLabs) efforts focuses on near-term goals to advance VMware’s relevance in AI and Generative AI. I lead the Americas engineering team focused on near-term goals to advance VMware’s relevance in AI and Generative AI. This position will be a contributor role for an existing early innovation project which has received extremely positive feedback from stakeholders including the CTO. The successful candidate will have the opportunity to work with other world class innovators and understand the dynamics of building new technology in a ‘startup like’ context within a large and mature company. The project has great visibility across the company with upcoming showcases to the industry. The xLabs experience is the perfect place for developers looking to blaze new trails, work on a high impact project and to see it through to a real product.\n\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nWithin your first 6 months Work closely with our UI/UX experts, designers, product managers and backend engineers to build modern, responsive, and modular rich web applications using React for our security copilot by attending internal training, reading technical material, and having conversations with peers and team members. Collaborate with backend engineers to create easily consumable APIs for frontend interfaces, present customer data in the web applications and allow users to interact with the system for anomaly detection and remediation. Contribute to product direction and design discussions.\n\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nThe successful candidate will be expected to code, perform code reviews and work closely with the product team. Additionally, the successful candidate will be able to communicate clearly with design, engineering and product in order to realize a delightful experience for our users.\n\nWhat are the benefits and perks of working at VMware?\nYou and your loved ones will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com. Medical Coverage, Retirement, and Parental Leave Plans for All Family Types Generous Time Off Programs 40 hours of paid time to volunteer in your community Rethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities Financial contributions to your ongoing development (conference participation, trainings, course work, etc.)\n\nFor US based candidates, the annual pay range (OTE for commissioned roles; Salary for other roles) for this position is: $139,000 - $331,000. The actual offer will be based on the role, location, and individual candidate experience. Bonus, commission, and/or equity may be eligible for this position. VMware offers comprehensive benefits including, but not limited to: medical, dental, and vision plans, company paid holidays, paid sick leave, and vacation time. Additional benefits for this position can be found at https://benefits.vmware.com/. Your talent advisor can share more about the specific salary range for your preferred location during the hiring process.\nThis job may require the candidate to travel and/or work from a facility that requires full vaccination prior to entry.\n\nCategory : Engineering and Technology\nSubcategory: Software Engineering\nExperience: Business Leadership\nFull Time/ Part Time: Full Time\nPosted Date: 2023-08-24\n\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=a609e9e55ab80597&fccid=c762a27145bd166e&vjs=3"
	},
	{
		"idjob" : 73,
		"jobTitle" : "Software Development Engineer – Resolution Enhancement Technology",
		"companyName" : "Siemens",
		"companyLocation" : "Fremont, CA",
		"jobDescription" : "We are looking for a highly motivated software engineer to work in the RET team in the Calibre business unit. You will be responsible for designing, developing, debugging and supporting the Calibre core software. You will be teaming up with a senior group of software engineers contributing to final production level quality of new components and algorithms and to support existing components. If you don’t already have experience in semiconductor manufacturing or computational lithography, this could be an exciting opportunity to learn leading edge technology and work on industry-leading software.\nJob Qualifications\nThe successful candidate will possess the following combination of education and experience\nDegree in engineering, computer-science, physics or mathematics or equivalent experience.\nExcellent programming skills in C and C++ on Linux platforms.\nExperience in OPC / RET is preferred but not required.\nStrong ability to learn and explore new technologies.\nGood analysis and problem solving skills.\nAbility to work on a team.\nExperience with GPU or other high-performance-computing is a plus.\nExperience with machine learning is a plus.\nAt Siemens we are always challenging ourselves to build a better future. We need the most innovative and diverse Digital Minds to develop tomorrow’s reality. Find out more about the Digital world of Siemens here: [1] www.siemens.com/careers/digitalminds\n\n\n\nEqual Employment Opportunity Statement\nSiemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.\n\nEEO is the Law\nApplicants and employees are protected under Federal law from discrimination. To learn more, Click here.\n\nPay Transparency Non-Discrimination Provision\nSiemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.\n\nCalifornia Privacy Notice\nCalifornia residents have the right to receive additional notices about their personal information. To learn more, click here.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=cb3464c10e24200c&fccid=ea6bb53f0b18b8f2&vjs=3"
	},
	{
		"idjob" : 74,
		"jobTitle" : "Research Scientist/Engineer – Computational Fluid Dynamics SW Development",
		"companyName" : "Science and Technology Corporation",
		"companyLocation" : "Moffett Field, CA",
		"jobDescription" : "Overview\nSTC supports the US Army's Technology Development Directorate (TDD) located at the NASA Ames Research Center at Moffett Field, CA. Much of this support involves the development and application of modeling and simulation tools for rotorcraft aerodynamics and structural dynamics in Army acquisition-related programs such as Future Vertical Lift. These modeling and simulation activities aim to improve performance, reduce risk, and enhance safety for Army rotorcraft. The Army’s primary computational fluid dynamics tool for high-fidelity rotary-wing aeromechanics simulations is called “Helios.” The Helios software consists of a number of multi-disciplinary computational modules that connect through a lightweight and object-oriented Python language infrastructure. Helios can analyze multiple-rotor, multiple-rotor and fuselage combinations with intended analysis applications for new Army rotorcraft acquisition activities that are part of the Army’s Future Vertical Lift (FVL) program.\nResponsibilities\nThe Helios development plan calls for annual software releases with major upgrades and improvements to individual software modules with each new release. This position requires the formulation, development, and testing of new and improved software modules for Helios. These new software improvements will involve new and improved, solution algorithms for existing flow solvers, new gridding strategies and flow solvers, new modeling capabilities such as rotorcraft maneuver, and new strategies for improved parallel scalability. This requirement requires creativity and vision for developing, implementing, and testing new capabilities that are targeted for future Helios software releases.\nQualifications\nThe successful candidate should have substantial experience and expertise in the development and application of high-fidelity computational fluid dynamics software and high-performance parallel computing. Experience in multi-disciplinary fluid and structural dynamics problems related to rotorcraft is also a plus. M.S. degree in Mechanical or Aerospace Engineering is required, Ph.D. is preferred. Candidate must be a U.S. Citizen or Green Card holder.\nJob Types: Full-time, Contract\nBenefits:\n401(k)\nDental insurance\nVision insurance\nSchedule:\n8 hour shift\nMonday to Friday\nWork Location: In person",
		"salary" : "Full-time, Contract",
		"employmentType" : "",
		"url" : "https://www.indeed.com/company/Science-and-Technology-Corporation/jobs/Research-Scientist-2717a2a417054099?fccid=53fdee41da51129a&vjs=3"
	},
	{
		"idjob" : 75,
		"jobTitle" : "Web Methods Developer Integration Analyst",
		"companyName" : "EMR CPR LLC",
		"companyLocation" : "Sunnyvale, CA",
		"jobDescription" : "Position: WebMethods Developer\nNOTE: Candidates must be able to interview in person\nLocation: Sunnyvale, CA\nType: Contract – 12 months\n“NOTE: If selected for this position, you are required to perform ALL work onsite, based on the client’s specified hybrid work schedule (currently onsite 3 days a week: Tuesday, Wednesday, and Thursday).”\nIntegration Analyst/WebMethods Developer (Sunnyvale)\nUsing the knowledge about web Methods product suite – Designer, Integration Server, and My web Methods Server (MWS) to look through the logic of existing services and modify them if needed.\nConfigured the EDI messages required by the trading partner\nAnalyzed and corrected the EDI transaction errors before resubmitting.\nCoordinate with the stakeholders for onboarding or issue resolution.\nConfigured partner profiles and TPA in My webMethods Servers for both inbound and outbound transactions.\nHave a good understanding of the ANSI X12 transaction sets like 810.850,855,997 etc., EDIFACT and FlatFiles and how they are being processed in webMethods\nInstalled certificates and established connectivity using protocols like AS2, SFTP, HTTPS, etc.\nUse Splunk logging and building Splunk queries to troubleshoot production and test issues.\nAnalyze, debug, and implement solutions for EDI-related production issues.\nExperience in Unix commands to check the configs, or process files\nJob Types: Full-time, Contract\nPay: $45.00 - $50.00 per hour\nSchedule:\n8 hour shift\nWork Location: In person",
		"salary" : "$45 - $50 an hour",
		"employmentType" : "- Full-time, Contract",
		"url" : "https://www.indeed.com/company/EMR-CPR/jobs/Web-Developer-3099cb47cb9277fc?fccid=240a09a330cd16cc&vjs=3"
	},
	{
		"idjob" : 76,
		"jobTitle" : "Core OS Embedded Driver Engineer",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Aug 24, 2023\nWeekly Hours: 40\nRole Number: 200497222\nAre you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. At the heart of Apple’s Software organization, the Core OS team is responsible for the design and development of core technologies that are deployed across all Apple product areas including the iPhone, iPad, Watch, MacBook, iMac, Apple TV, and Audio Accessories (Yes, that’s pretty much everything!). As a member of the Core OS HID & Drivers team, you will be working on cutting edge new silicon IP development, next generation HW bringup, and low-level driver development!\nKey Qualifications\nExperience with new silicon and HW bringup\nExperience with writing and debugging complex low level drivers and related frameworks\nEmbedded System software/firmware development experience.\nKnowledge of C and C++\nProven creative, critical thinking and troubleshooting skills\nHighly professional, with the ability to deliver solid work on tight schedules\nExcellent collaborative skills\nExcellent knowledge of system architecture\nStrong written and verbal communication skills\nDescription\nWork with a highly skilled engineering team in new SOC/HW bringup, and embedded driver development Work with cross-functional teams to support product requirements for embedded products Own feature design, implementation, and debug across kernel, user space, and proprietary co-processor runtime environments. Lead and carry forward highly complex software and hardware efforts.\nEducation & Experience\nBS in Computer Science/Computer Engineering or equivalent experience/skills\nAdditional Requirements\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $138,900 and $256,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=4dd4bab83c6d3682&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 77,
		"jobTitle" : "Platform Kernel Engineer",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Apr 21, 2023\nWeekly Hours: 40\nRole Number: 200475378\nAre you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices! The Platform Kernel team within Apple's Core OS organization is looking for an exceptional engineer to work on state-of-the art kernel technology for macOS and iOS. Working on a core technology for Darwin, you will have the opportunity to have a major impact on the design and implementation of Apple's operating systems.\nKey Qualifications\nDeep understanding of the C programming language\nPrevious experience with UNIX kernel engineering\nGenuine passion for kernel technology and systems engineering\nProgramming in ARM assembly\nUnderstanding of modern CPU design\nExtensive knowledge of hardware platforms & processor architectures\nLow level debugging experience\nDemonstrated creative, critical thinking and troubleshooting skills\nHighly professional, with the ability to deliver solid work on tight schedules\nExcellent collaborative skills including written and verbal communication\nDescription\n- Work with a highly skilled engineering team in the design and implementation of kernel technologies - Drive product features and specifications on Apple’s product line - Bring up, verification, and debug of new hardware platforms - Work with cross-functional teams to support product requirements\nEducation & Experience\nBS in Computer Science or equivalent experience/skills\nAdditional Requirements\nExperience with multiple hardware architectures\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $138,900 and $256,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=4375a22c2a9bad77&fccid=c1099851e9794854&vjs=3"
	},
	{
		"idjob" : 78,
		"jobTitle" : "Firmware Engineer",
		"companyName" : "Athelas",
		"companyLocation" : "Mountain View, CA 94041",
		"jobDescription" : "Firmware Engineer\nJob#10\nDate Posted: August 22nd, 2023\nAt Athelas we're bringing simple, life-changing health care products and medical billing services to people around the globe.\nIn addition to our established Remote Patient Monitoring business, we introduced a rapidly expanding SaaS Revenue Cycle Management solution in 2022 that provides revenue intelligence for hundreds of healthcare businesses from small clinics to large health systems. Our state-of-the-art dashboard, Athelas Insights, provides practices with an unparalleled understanding into their financial health to help them with all aspects of RCM, including eligibility, rejections, denials, as well as coding optimization and more.\nTo keep pace with our remarkable momentum - having seen a 5x increase in revenue over the past 6 months with more exponential growth on the horizon - we're actively seeking new, high-impact team members looking for a challenge!\nWe've raised $132 million at a $1.5 billion valuation from top tier investors such as General Catalyst, Sequoia Capital, Y Combinator, and Initialized.\nDuties\nDefine product requirements and contribute towards the embedded firmware development efforts.\nImprove processes related to embedded firmware development - Board bring up, feature development, firmware validation and testing.\nParticipate in firmware design, circuit design and improve product manufacturing steps\nImplement device drivers in C/C++, Integrate BLE sensors using real-time systems for accurate health metrics measurements.\nWrite test plans to ensure product robustness - define unit tests, end-to-end and regressions tests for all firmware.\nDevelop camera algorithms using OpenCV and python over linux OS.\nDevelop MVPs for new products and accelerate our concept validation cycles.\nEnable secure over-the-air updates for all products using our backend infrastructure.\nDocument specs and design documents as needed.\nWhat You Have:\nJob requires Master’s in EE/CE/CS\nTwo years’ experience. Must be able to perform the job tasks, including having knowledge of embedded firmware development. $141,378/yr\nWhy You’ll Like Working with Athelas\nRockstar Team: Join a team with an incredible record - we are the smallest, fastest company in history to receive FDA hematology clearance. We are also the largest Remote Patient Monitoring company in the US, with a fast-growing SaaS Revenue Cycle Management business as well\nTechnology Focus: Revolutionizing how technology can be used in the healthcare industry\nStrong Backing: $132M Series B raised from the likes of Sequoia, General Catalyst, Tribe, Y Combinator\nMission Driven: We are changing the way healthcare is provided, bringing it directly to the people who need it with technology-enabled solutions\nIncredible Growth: Revenue growth of 5x over the past 6 months and we're just getting started!",
		"salary" : "$141,378 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=db75ce13ac015475&fccid=35d650c9e54bdf3c&vjs=3"
	},
	{
		"idjob" : 79,
		"jobTitle" : "Python Developer",
		"companyName" : "Cognizant Technology Solutions",
		"companyLocation" : "Alameda, CA 94501",
		"jobDescription" : "Python Developer\n\nCognizant Digital Engineering practice is looking to hire an Python Developer Experience in designing and implementing robust applications writing effective and scalable Python codes, and good knowledge Django, Flask or similar Python frameworks.\nCognizant Digital Practice helps clients reinvent products, experiences, and business models to create new value, differentiation, and drive revenue in the digital economy. We take an Experience centered approach which uses human insights to take ideas from vision to outcome and building end to end experience led solutions that enables brands to transform their customer and employee experiences using design, marketing, and commerce capabilities.\n\nDay-To-Day Responsibilities:\nPython Developer Experience in designing and implementing robust applications writing effective and scalable Python codes\nPython3 , Flask Python, JavaScript\nDebugging applications to ensure low-latency and high-availability Integrating user-facing elements with server-side logic\nImplementing security and data protection Accommodating various data storage solutions lls\nNice to have skills: Java, Spring Boot, MySQL, SQL,AWS.\nShall have good knowledge Django, Flask or similar Python frameworks.\nJavaScript, Java, PostgreSQL DB Administration, SQL\nAccommodating various data storage solutions\n\nKey Qualifications:\n\nPython3 , Flask Python, JavaScript\nJava, Spring Boot, MySQL, SQL, Azure/AWS /GCP\nDjango, Flask or similar Python frameworks\nJavaScript ,PostgreSQL DB Administration, SQL\n\nLocation: Plano, Texas\n\nBenefits: Cognizant offers the following benefits for this position, subject to applicable eligibility requirements:\nMedical/Dental/Vision/Life Insurance\nPaid holidays plus Paid Time Off\n401(k) plan and contributions\nLong-term/Short-term Disability\nPaid Parental Leave\nEmployee Stock Purchase Plan\n\nDisclaimer: Benefits information is accurate as of the date of this posting. Cognizant reserves the right to modify this information at any time, subject to applicable law.\nWhy Choose Cognizant?\nIt takes a lot to succeed in today’s fast-paced market, and Cognizant Technology Solutions has become a leader in the industry. We love big ideas and even bigger dreams. We stand out because we put human experiences at the core.\nOur associates enjoy robust benefits and training opportunities from our industry recognized, award winning Academy team. You will have access to hundreds of technical trainings to keep your skillsets fresh and have opportunities to obtain certifications on the latest technologies.\nIf you’re comfortable with ambiguity, excited by change, and excel through autonomy, we’d love to hear from you!\nAbout Cognizant\nCognizant is an equal opportunity employer provider and committed to creating a diverse environment. Headquartered in the U.S, Cognizant is a member of the S&P-500, Nasdaq-100, Fortune 200, and recently ranked as the #1 Fastest Growing “All Star” by Fortune Magazine. Cognizant demonstrates a highly flexible business model, a detailed global delivery network, and deep domain expertise to deliver to a long list of outstanding companies that are leaders in their own space.\nLearn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant.\nApply today!\n\n#LI-JD4\n#LI-JC1\n#CB\n#Ind123\nEmployee Status : Full Time Employee\nShift : Day Job\nTravel : No\nJob Posting : Aug 24 2023\nAbout Cognizant\nCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 185 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.\nApplicants may be required to attend interviews in person or by video conference. In addition, candidates may be required to present their current state or government issued ID during each interview.\nCognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.\nIf you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=af640c337aec429e&fccid=2df6a1e69a70a1e7&vjs=3"
	},
	{
		"idjob" : 81,
		"jobTitle" : "UKG Technical Lead",
		"companyName" : "PRO IT",
		"companyLocation" : "879 Adonis Ct, Sunnyvale, CA 94086",
		"jobDescription" : "Job Title: UKG Technical Lead\nLocation: Sunnyvale-CA\nJob Description: Fulltime Role with TCS\nTechnical Lead (Java, Python, Integration), UKG migration experience (Kronos to Dimensions).\nHands-on experience using Java, Python\nSpring boot / Spring MVC experience, Kafka\nMultithreading concepts and experience.\nIntegration experience using Web Methods & other industry leading tools, Dell Boomi.\nKnowledge of technical principles, practices, and procedures to implement and maintain system solutions.\nMigration Lifecycle from WFC (Kronos) to Dimensions\nExperience with SaaS solutions – integration, security, network, platform architecture.\nJava, Python, Kafka\nMigration from Kronos / WFC to Dimensions.\nResponsibilities:\nTechnical Lead (Technical Architecture, Design, Development, Leading team of Consultants, Migration, Cutover).\nParticipating on Agile / Scrum teams as Technical lead.\nJob Type: Full-time\nPay: $91,616.51 - $110,333.86 per year\nBenefits:\n401(k)\nDental insurance\nHealth insurance\nSchedule:\n8 hour shift\nAbility to commute/relocate:\nSunnyvale, CA 94086: Reliably commute or planning to relocate before starting work (Required)\nWork Location: In person",
		"salary" : "$91,617 - $110,334 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/company/PRO-IT/jobs/Technical-Lead-25778d6aa853e8a4?fccid=46538a74a4e9d584&vjs=3"
	},
	{
		"idjob" : 82,
		"jobTitle" : "Splunk with python Scripting/Developer",
		"companyName" : "Purple Drive Technologies",
		"companyLocation" : "Purple Drive Technologies in Sunnyvale, CA 94086",
		"jobDescription" : "Splunk\nPython\nShell scripting\nExperience on Splunk monitoring\nExperience with interacting with customers configuration and optimization in Splunk.\nExperience with using scripting languages to automate tasks and manipulate data.\nJob Type: Full-time\nSalary: From $120,000.00 per hour\nAbility to commute/relocate:\nSunnyvale, CA 94086: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nPython: 1 year (Preferred)\nSplunk: 1 year (Preferred)\nWork Location: In person",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/company/Purple-Drive-Technologies/jobs/Python-Developer-59150e7e4a223843?fccid=b50885016c495d25&vjs=3"
	},
	{
		"idjob" : 83,
		"jobTitle" : "Software Verification Engineer- Operations",
		"companyName" : "Joby Aviation",
		"companyLocation" : "761 Neeson Road, Marina, CA 93933",
		"jobDescription" : "Joby Overview: Located in Northern California, the team at Joby Aviation is driven by our goal of creating an affordable, all-electric air transportation system. Imagine a piloted air taxi that takes off vertically, then quietly carries you and your fellow passengers over the congested city streets below, enabling you to spend more time with the people and places that matter most. Since 2009, our team has worked steadily to make this dream a reality. We’ve designed and tested many generations of prototype aircraft capable of serving in a network of electric air taxis. We’re looking for talented, committed individuals to join our team as we push onwards toward certifying the Joby aircraft with the Federal Aviation Administration, scaling our manufacturing, and preparing to launch commercial service in 2025. Overview:\nAviation Software requires comprehensive testing to ensure safety and to meet flight certification standards. Help Joby Aviation achieve software certification by testing the Embedded C/C++ code that controls vehicle flight and system monitoring. In this role you will work with a range of software, processor in the loop, and hardware in the loop simulators representative of the eVTOL system. Design, execute and maintain test cases, test reports, and supporting documentation for software certification and validation purposes. Become the Software Verification product expert on flight-critical software components and own the testing process. Additionally, you will use automated UI testing tools to automate testing of the system’s ground control software. Candidate should be an energetic, meticulous, self-motivated person with an adamant belief in the importance of product quality. If you love working with new technology, and have passion for innovation and safety, this is the job for you.\nRequired:\nS. in Computer Science, Mathematics, Mechanical Engineering, Aerospace Engineering and 3+ years Industry Experience in Quality Assurance or Test Engineering. An advanced degree and 1+ years of relevant experience or the equivalent demonstratable real-world experience will also be considered.\nStrong background in Software Test and Verification on embedded systems.\nInterfacing with embedded software and electronic hardware.\nDevelopment, execution, and reporting of manual test cases.\nStrong debugging and troubleshooting skills.\nReporting of defects and quality metrics.\nProject management, bug tracking and continuous integration tools, e.g JIRA, Jenkins, Team City.\nMust be able to support on-site testing (Santa Cruz, Marina, and/or southern Monterey County).\nFlexible schedule\nDesired:\nDO-178C Software Certification experience.\nAgile software development and Test Driven Development.\nRobotics Project(s) and/or Drone experience.\nPiloting aircraft, avionics hardware, electric cars or similar systems.\nPython programming and shell scripting proficiency.\nNetworking fundamentals.\nHands-on skills to design, build, bring up and debug test benches\nPlease still apply if you don’t meet all items in the desired section! Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. We are dedicated to building a diverse and effective workplace, so if you’re excited about this role but your experience doesn’t align perfectly with every qualification, we encourage you to apply anyway. You may be just the right candidate for this or other roles.\nCompensation at Joby is a combination of base pay and Restricted Stock Units (RSUs). The target base pay for this position is $79,700-$130,500. The compensation package offered will be determined by location, job-related knowledge, skills, and experience.\nJoby also offers a comprehensive benefits package, including paid time off, healthcare benefits, a 401(k) plan with a company match, an employee stock purchase plan (ESPP), short-term and long-term disability coverage, life insurance, and more.\nEEO:\nJoby is an Equal Opportunity Employer.",
		"salary" : "$79,700 - $130,500 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=19d7875b071750c7&fccid=4922aa0d050a55de&vjs=3"
	},
	{
		"idjob" : 84,
		"jobTitle" : "Senior Backend Software Engineer",
		"companyName" : "Amira",
		"companyLocation" : "San Francisco, CA",
		"jobDescription" : "About Amira\nWhen was the last time you heard anyone talk about menopause? Probably never. Most young adults don’t really know what it is. The taboo around menopause has left it neglected by innovators and engineers for far too long. We founded Amira to change that reality. Amira is on a mission to reimagine this stage of women’s lives with a new, data-driven approach, leveraging precision bio-monitoring, AI-enabled health recommendations, and preventive care solutions.\nWe’re starting with revolutionizing the way menopausal women sleep. We have invented the first wearable that predicts hot flashes and preemptively actuates a cooling mattress pad to provide relief and keep women asleep. We are currently ramping up for manufacturing and will be shipping our product to women’s homes in Q2 of 2024. Amira is a close-knit team of MIT engineers, Harvard PhDs, ex-nuclear fusion engineers, and Google X data scientists. We’ve just raised our first round of funding and are looking to add bright motivated minds to our team.\nCurious to learn more? Join Amira’s trailblazing team at the forefront of merging cutting-edge technology with compassionate healthcare and become a driving force in reimagining menopause. Applying your technical talents to reinventing menopausal healthcare may become the most impactful thing you do to unlock human potential.\nJob Description\nWe have a full-stack that spans from sensor hardware and low-level firmware all the way up to a mobile app, a cloud server, and machine learning. We're looking for someone to work with us to build the cloud infrastructure and functionality needed to move from small-scale prototype-level tests into production. If you have expertise in developing back-end software for server deployment, and want to solve challenging problems on a small, passionate, engineering-focused team, we'd love to hear from you.\nRequirements\nResponsibilities\nMaintain our auth and algorithm services, and create features to:\nHelp streamline data transfer across the system.\nProvide backend support for a seamless and thorough user experience while adding new features.\nDevelop API server infrastructure.\nExtend our software testing architecture.\nDrive the development of our software strategy and help build an effective and collaborative team.\nTackle challenging problems related to concurrency and security-focused development.\nAct as a sounding board for new ideas and initiatives as well as help solve big, critical problems with long-term implications.\nTake ownership of a mixture of big and small, short and long-term tasks and strategic projects including running special projects that are urgent and important.\n\nYou are\nA skilled programmer with experience in Python, Rust, SQL, gRPC, XMLRPC, and Tensorflow (interfacing).\nA natural communicator. You communicate concisely and clearly and keep cool under pressure. You’re a good collaborator and team player. You work well with all levels of internal teams and external with high professionalism.\nTalented, versatile, and loyal. You will serve as a technical advisor and confidant to the CTO.\nOrganized and energetic. You are meticulously organized and tech-savvy, you are reliable and accountable, and driven to get things done.\nIntellectually curious, motivated and optimistic.\n\nYou Have\nA college degree and ample work experience.\nSuperhero-like abilities to get things done and the ability to learn on your own.\nA natural attention to detail. Burning desire to have a positive impact on society.\nBenefits\nBe at the forefront of advancing menopause healthcare technology and contribute to groundbreaking innovations for women's well-being.\nEmbrace a dynamic team culture, fascinating work, and a stimulating office environment.\nEngage with a variety of other leading, innovative companies in the healthcare industry.\nMedical, dental & vision insurance coverage.\nFertility HRA (up to $5,000 per year).\nFlexible PTO.\nAll meals and drinks consumed at the office are covered.\nHealth & wellness stipend.\nTherapy stipend.",
		"salary" : "$90,000 - $150,000 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=c1740af38abb15c1&fccid=42b766da2b8c529b&vjs=3"
	},
	{
		"idjob" : 85,
		"jobTitle" : "IS Programmer Analyst – Principal – SFPD (1064)",
		"companyName" : "City and County of San Francisco",
		"companyLocation" : "1245 3rd Street, San Francisco, CA 94158",
		"jobDescription" : "Company Description\n\nWho We Are: The San Francisco Police Department was established in 1849 and continually strives to become a more effective, inclusive and modern police department, while earning the trust and pride of those we serve and those who serve. Our goal is to reflect on current SFPD initiatives, assess best practices across the country, and evaluate the changing environment in policing and within the City to arrive at a strategy statement that the Department and our community can embody every day.\nThe San Francisco Police Department stands for Safety and Respect for All. We will engage in just transparent unbiased and responsive policing. We will do so in the spirit of dignity and in collaboration with the community. And we will maintain and build trust and respect as the guardians of Constitutional and human rights.\nThe San Francisco Police Department is committed to excellence in law enforcement and is dedicated to the people, traditions and diversity of our City. The department provides service with understanding, response with compassion, performance with integrity and law enforcement with vision. The department has grown into a nationally known police department providing law enforcement services to one of the most recognized cities in the United States.\nSpecific information regarding this recruitment process are listed below:\nApplication Opening: August 21, 2023\nApplication Deadline: Apply immediately, announcement may close anytime after 2 weeks from posting date.\nClass & Compensation: $133,432 - $180,804\nRecruitment ID: PEX-1064-138608\nAppointment Type: Permanent Exempt - This position is excluded by the Charter from the competitive Civil Service examination process and shall serve at the discretion of the Appointing Officer. The duration of the appointment shall not exceed 36 months.\nWork Location: SFPD Headquarters, 1245 3rd Street, San Francisco, CA 94158\nWork Schedule: Monday - Friday, Full-time, Hybrid Telecommuting work schedule available in line with CCSF policy.\n\nJob Description\n\nUnder general direction, the IS Programmer Analyst-Principal works in the SFPD Technology Division and is responsible for developing, testing, implementing, and supporting business intelligence solutions in (OAS), Oracle Data Integrator, and other Business Intelligence tools. This position will be Lead ETL (extract, transform, load) programmer of the department for the National Incident-Based Reporting System (NIBRS) project.\nESSENTIAL DUTIES:\nLead NIBRS ETL/ELT projects. Programs and trains other analysts in related projects & tasks.\nData modeler.\nDevelop Oracle Analytic Server (OAS) dashboard and reports.\nETL/ELT development and maintenance for NIBRS based projects, and various team projects.\nDevelopment process responsibilities include but are not limited to scoping requirements, design, development, testing, presenting, release, documentation, training, and support.\nMaintain development and production environments for OAS administration, OAS reporting, and user security for the SFPD Business Intelligence System.\nDemo ETLs, models, reports and, dashboards to internal and external staff.\nWork on Geographic Information System (GIS) projects such as migration of data from OAS to ArcGIS.\nTrain all ETL programmers to ensure 24/7 back up support when needed.\nMay be required to supervise and be on call on an emergency basis.\nPerform related duties and responsibilities, as assigned.\n\nQualifications\n\n1. Education: An associate degree in computer science or closely related field from an accredited college or university OR its equivalent in terms of total course credits/units [i.e., at least sixty (60) semester or ninety (90) quarter credits/units with a minimum of twenty (20) semester or thirty (30) quarter credits/units in computer science or a closely related field].\nAND\n2. Experience: Five (5) years of full-time experience in applications or software programming or development.\nSubstitution: Additional experience as described above may be substituted for the required degree on a year-for-year basis (up to a maximum of two (2) years). One (1) year is equivalent to thirty (30) semester units / forty-five (45) quarter units with a minimum of 10 semester / 15 quarter units in computer science or a closely related field.\nNote: One year of full-time employment is equivalent to 2000 hours. (2000 hours of qualifying work experience is based on a 40-hour work week.) Any overtime hours that you work above forty (40) hours per week are not included in the calculation to determine full-time employment.\nDesirable Qualification: The stated desirable qualifications may be considered at the end of the selection process when candidates are referred for hiring.\nWorking knowledge of the following:\nOracle Business Intelligence tools.\nOracle Analytic Server (OAS).\nGeographic Information Systems (GIS).\nETL/ELT Experience (Oracle Data Integrator, SSIS, Informatica).\nVerification of Education and Experience: Applicants may be required to submit verification of qualifying education and experience at any point during the recruitment and selection process. If education verification is required, information on how to verify education requirements, including verifying foreign education credits or degree equivalency, can be found at https://sfdhr.org/how-verify-education-requirements\nNote: Falsifying one’s education, training, or work experience or attempted deception on the application may result in disqualification for this and future job opportunities with the City and County of San Francisco.\nAll work experience, education, training and other information substantiating how you meet the minimum qualifications must be included on your application by the filing deadline. Information submitted after the filing deadline will not be considered in determining whether you meet the minimum qualifications.\nResumes will not be accepted in lieu of a completed City and County of San Francisco application.\nApplications completed improperly may be cause for ineligibility or disqualification.\nBackground Investigation: Prior to employment with the San Francisco Police Department, a thorough background investigation will be conducted to determine the candidate’s suitability for employment. The investigation may include, but not be limited to: criminal history records, driving records, drug/alcohol screening, and other related employment and personal history records. Reasons for rejection may include use of controlled substances and alcohol, felony conviction, repeated or serious violations of the law, inability to work with co-workers, inability to accept supervision, inability to follow rules and regulations or other relevant factors. Candidates may be required to undergo drug/alcohol screening, and must clear Department of Justice and Federal Bureau of Investigation fingerprinting. Criminal records will be carefully reviewed; candidates who do not report their complete criminal records on their applications will be disqualified. Applicants will be fingerprinted.\n\nAdditional Information\n\nRecruiter Information: If you have any questions regarding this recruitment or application process, please contact the Staff Services analyst, Danny Wan at danny.wan@sfgov.org.\nAdditional Information Regarding Employment with the City and County of San Francisco:\nInformation About The Hiring Process\nConviction History\nEmployee Benefits Overview\nEqual Employment Opportunity\nDisaster Service Worker\nADA Accommodation\nRight to Work\nCopies of Application Documents\nDiversity Statement\nSFPD Recruitment: https://www.sanfranciscopolice.org/your-sfpd/careers\nHOW TO APPLY\nApplications for City and County of San Francisco jobs are only accepted through an online process. Visit https://careers.smartrecruiters.com/CityAndCountyOfSanFrancisco1/ and begin the application process.\nSelect the “I’m Interested” button and follow instructions on the screen\nCONDITION OF EMPLOYMENT: All City and County of San Francisco employees are required to be fully vaccinated against COVID-19 as a condition of employment. Someone is fully vaccinated when 14 days have passed since they received the final dose of a two-shot vaccine or a dose of a one-shot vaccine. Any new hire must present proof of full vaccination status to be appointed. Any new hire must present proof of full vaccination status to be appointed.\nThe City and County of San Francisco encourages women, minorities and persons with disabilities to apply. Applicants will be considered regardless of their sex, race, age, religion, color, national origin, ancestry, physical disability, mental disability, medical condition (associated with cancer, a history of cancer, or genetic characteristics), HIV/AIDS status, genetic information, marital status, sexual orientation, gender, gender identity, gender expression, military and veteran status, or other protected category under the law.",
		"salary" : "$133,432 - $180,804 a year",
		"employmentType" : "- Full-time",
		"url" : "https://www.indeed.com/rc/clk?jk=bec7467915e4e516&fccid=a411072d5a46f13f&vjs=3"
	},
	{
		"idjob" : 93,
		"jobTitle" : "iOS Field Diagnostics Architect",
		"companyName" : "Apple",
		"companyLocation" : "Cupertino, CA",
		"jobDescription" : "Summary\nPosted: Jun 21, 2023\nWeekly Hours: 40\nRole Number: 200484844\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. As an iOS Field Diagnostics Architect, you will be the end-to-end owner of all technical aspects for the design, qualification and implementation of hardware diagnostic tools used during field service events. Responsibilities include definition and design of new diagnostic tools based on customer requirements, device architecture, and diagnostics system/platform, as well as development of diagnostic qualification plans that account for design, field risk, and diagnostic performance across service channels.\nKey Qualifications\nAbility to synthesize customer needs, product architecture, and use cases into a high-level diagnostic design.\nAbility to collaborate with experts throughout the diagnostic development process, identifying and working with essential teams to support requirements, design, development, qualification, implementation, and performance. Engage additional experts to ensure field diagnostic solution meets Apple’s broader requirements and commitments.\nSolid understanding of product development lifecycles, from specification to launch. Ability to engage key product development teams at specific lifecycle landmarks to enable product feature interactivity to support field diagnostic functionality.\nFamiliarity with server-client design principles and considerations, ensuring effective integration and communication between diagnostic systems and components.\nExcellent verbal skills across various organizational levels. Ability and strong willingness to engage team members one-on-one or as a group to foster dialogue of ideas.\nExcellent written skills for clear reporting. Ability and willingness to build comprehensive written documentation throughout the diagnostic development lifecycle.\n8+ years work experience\nDescription\nAs the iOS Field Diagnostics Architect, you will lead cross-functional teams during the development cycle to define, design, and qualify diagnostic tests to ensure successful rollouts. This role requires strong communication, persuasion and negotiation skills, in addition to becoming comfortable with working through ambiguities. Responsibilities include: Engage with customers to gather requirements and understand their diagnostic needs, and translate them into technical requirements for diagnostic solutions. Document requirements and conduct playbacks to customers to ensure accuracy. Engage with product development teams to understand the product feature architecture and establish the diagnostic design and testing parameters. Propose a field diagnostic design proposal based on customer needs and product architecture. Identify cross-functional teams required for design refinement, development, qualification, and implementation. Work with the TPM to engage cross-functional teams and identify responsible individuals for each action item and deliverable during the development lifecycle. Collaborate with Diagnostic Designers to define the end-to-end diagnostic flow, ensuring a seamless and efficient diagnostic process. Work closely with Diagnostic Solutions Architect to identify and define key system integrations required to support diagnostic functionality and facilitate successful deployment. Detail the diagnostic design and conduct playbacks to customers. Communicate any deviations from the agreed design to customers and leadership for approval. Ensure diagnostic quality and performance by collaborating with the QA team to develop and sign-off qualification plans that challenge the diagnostic design and field use cases. Define diagnostic test plans, pilot strategies, release strategies, and field performance management in collaboration with the cross-functional team. Coordinate diagnostic demo sessions and team syncs, including leadership, in collaboration with the TPM.\nEducation & Experience\nMSCE/CS or equivalent work experience required\nAdditional Requirements\nPay & Benefits\nAt Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $199,800 and $300,200, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
		"salary" : "Full-time",
		"employmentType" : "",
		"url" : "https://www.indeed.com/rc/clk?jk=3d6fb2492191e1d9&fccid=c1099851e9794854&vjs=3"
	}
]
